create_clock -period 1.000 -name aclk -waveform {0.000 0.500} [get_ports aclk]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {GAIN0_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {GAIN0_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {GAIN1_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {GAIN1_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {GAIN2_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {GAIN2_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {GAIN3_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {GAIN3_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {GAIN4_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {GAIN4_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {GAIN5_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {GAIN5_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {GAIN6_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {GAIN6_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {GAIN7_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {GAIN7_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {PINC0_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {PINC0_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {PINC1_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {PINC1_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {PINC2_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {PINC2_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {PINC3_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {PINC3_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {PINC4_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {PINC4_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {PINC5_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {PINC5_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {PINC6_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {PINC6_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {PINC7_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {PINC7_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {POFF0_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {POFF0_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {POFF1_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {POFF1_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {POFF2_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {POFF2_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {POFF3_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {POFF3_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {POFF4_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {POFF4_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {POFF5_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {POFF5_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {POFF6_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {POFF6_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {POFF7_REG[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {POFF7_REG[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports {s_axis_tdata_i[*]}]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports {s_axis_tdata_i[*]}]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports WE_REG]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports WE_REG]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports aresetn]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports aresetn]
set_input_delay -clock [get_clocks aclk] -min -add_delay 0.100 [get_ports s_axis_tvalid_i]
set_input_delay -clock [get_clocks aclk] -max -add_delay 0.200 [get_ports s_axis_tvalid_i]
set _xlnx_shared_i0 [get_ports {m_axis_tdata_o[*]}]
set_output_delay -clock [get_clocks aclk] -min -add_delay 0.090 $_xlnx_shared_i0
set_output_delay -clock [get_clocks aclk] -max -add_delay 0.300 $_xlnx_shared_i0
set_output_delay -clock [get_clocks aclk] -min -add_delay 0.090 [get_ports m_axis_tvalid_o]
set_output_delay -clock [get_clocks aclk] -max -add_delay 0.300 [get_ports m_axis_tvalid_o]
set_output_delay -clock [get_clocks aclk] -min -add_delay 0.090 [get_ports s_axis_tready_o]
set_output_delay -clock [get_clocks aclk] -max -add_delay 0.300 [get_ports s_axis_tready_o]

set_false_path -to [all_outputs]
